app/views/movies/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 10]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 14]]
---
                    <div>
                        <% @reviews = @movie.reviews.average("rating").to_i.times do %>

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 14]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 14]]
---
                    </div>
                        <span class="number-of-reviews">Based on <%= @movie.reviews.count %> reviews</span>