app/controllers/movies_controller.rb

SELECT "categories".* FROM "categories"
SELECT "movies".* FROM "movies" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Fantasy"], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."category_id" = ? ORDER BY created_at DESC  [["category_id", 2]]
---
    def index
        if params[:category].blank?
            @movies = Movie.all.order("created_at DESC")
        else
            @category_id = Category.find_by(name: params[:category]).id
            @movies = Movie.where(:category_id => @category_id).order("created_at DESC")

SELECT "categories".* FROM "categories"
---
    def new
        @movie = current_user.movies.build
        @categories = Category.all.map{ |c| [c.name, c.id] }

INSERT INTO "movies" ("title", "description", "director", "created_at", "updated_at", "user_id", "category_id", "movie_img_file_name", "movie_img_content_type", "movie_img_file_size", "movie_img_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @movie = current_user.movies.build(movie_params)
        @movie.category_id = params[:category_id]

        if @movie.save

SELECT "categories".* FROM "categories"
---
    def edit
        @categories = Category.all.map{ |c| [c.name, c.id] }

UPDATE "movies" SET "movie_img_file_name" = ?, "movie_img_content_type" = ?, "movie_img_file_size" = ?, "movie_img_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = ?
---
    def update
        @movie.category_id = params[:category_id]
        if @movie.update(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def find_movie
        @movie = Movie.find(params[:id])