app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "created_at", "updated_at", "user_id", "movie_id") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "nice movie"], ["created_at", "2018-11-15 14:28:49.115761"], ["updated_at", "2018-11-15 14:28:49.115761"], ["user_id", 2], ["movie_id", 15]]
---
    def create
        @review = Review.new(review_params)
        @review.movie_id = @movie.id
        @review.user_id = current_user.id

        if @review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def edit
        @review = Review.find(params[:id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["comment", "Not bad!"], ["updated_at", "2018-11-14 11:49:27.063755"], ["id", 1]]
---
    def update
        @review = Review.find(params[:id])

        if @review.update(review_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
        def find_movie
            @movie = Movie.find(params[:movie_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
        def find_review
            @review = Review.find(params[:id])